[
    {
      "id": "1",
      "title": "Client Assistance",
      "image": "https://private-user-images.githubusercontent.com/115803124/353493647-c0987022-6581-41c7-b53c-3bb3839b221d.jpg?jwt=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJnaXRodWIuY29tIiwiYXVkIjoicmF3LmdpdGh1YnVzZXJjb250ZW50LmNvbSIsImtleSI6ImtleTUiLCJleHAiOjE3MjIzNTQyMzAsIm5iZiI6MTcyMjM1MzkzMCwicGF0aCI6Ii8xMTU4MDMxMjQvMzUzNDkzNjQ3LWMwOTg3MDIyLTY1ODEtNDFjNy1iNTNjLTNiYjM4MzliMjIxZC5qcGc_WC1BbXotQWxnb3JpdGhtPUFXUzQtSE1BQy1TSEEyNTYmWC1BbXotQ3JlZGVudGlhbD1BS0lBVkNPRFlMU0E1M1BRSzRaQSUyRjIwMjQwNzMwJTJGdXMtZWFzdC0xJTJGczMlMkZhd3M0X3JlcXVlc3QmWC1BbXotRGF0ZT0yMDI0MDczMFQxNTM4NTBaJlgtQW16LUV4cGlyZXM9MzAwJlgtQW16LVNpZ25hdHVyZT05ZjhhMGM5N2JlODAwNTM0ZDIxOWU4ZmIyOTMxOTU1ZTQ0MjJhMDk2ZjI4ODAxMDRjZWEzNDM3OTMxNzAzYjg2JlgtQW16LVNpZ25lZEhlYWRlcnM9aG9zdCZhY3Rvcl9pZD0wJmtleV9pZD0wJnJlcG9faWQ9MCJ9.UTRrmcDNtPzSV0uo79JxaXcF1sj0NGf6eTHxsQT0sAg",
      "description": "The client Assistance Program provides direct one-to-one comprehensive information and qualifying criteria for different programs.We assist eligible legal permanent residents and citizens in applying for a broad range of immigration services including guiding the clients through the citizenship processes.Our experienced attorneys assist you in obtaining temporary or permanent immigration status which is not limited to executive, managerial, and professional employees, but is extended to other immigration-related services.Our comprehensive business immigration legal services include assistance with sourcing a business, sharing the financials of the business, and Visa processing.Applicants can share the cv at info@flyhigh-abroad.com for initial assessment and can check their eligibility."
    },
    {
      "id": "2",
      "title": "Consultation Services",
      "image": "https://private-user-images.githubusercontent.com/115803124/353451044-18f60fa1-b955-4148-bf58-2808013bb44c.jpg?jwt=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJnaXRodWIuY29tIiwiYXVkIjoicmF3LmdpdGh1YnVzZXJjb250ZW50LmNvbSIsImtleSI6ImtleTUiLCJleHAiOjE3MjIzNTQyMzAsIm5iZiI6MTcyMjM1MzkzMCwicGF0aCI6Ii8xMTU4MDMxMjQvMzUzNDUxMDQ0LTE4ZjYwZmExLWI5NTUtNDE0OC1iZjU4LTI4MDgwMTNiYjQ0Yy5qcGc_WC1BbXotQWxnb3JpdGhtPUFXUzQtSE1BQy1TSEEyNTYmWC1BbXotQ3JlZGVudGlhbD1BS0lBVkNPRFlMU0E1M1BRSzRaQSUyRjIwMjQwNzMwJTJGdXMtZWFzdC0xJTJGczMlMkZhd3M0X3JlcXVlc3QmWC1BbXotRGF0ZT0yMDI0MDczMFQxNTM4NTBaJlgtQW16LUV4cGlyZXM9MzAwJlgtQW16LVNpZ25hdHVyZT02ZGRjNDJlMDRkNzZjYjY3ODFlMzdiMjlkNDYyNjMwYjU3MTc0Y2RjMWY3MzBhMWM4ZTM0YzkzYzcwMzIxYjQ0JlgtQW16LVNpZ25lZEhlYWRlcnM9aG9zdCZhY3Rvcl9pZD0wJmtleV9pZD0wJnJlcG9faWQ9MCJ9.Iz3D17wvqC_EtreXEBNAJ_5E27g5jxt1x2LTz7YEGCc",
      "description": "Through our consultation services, we offer you the opportunity to visit the Immigration Consultants who are endowed with immense knowledge on the Visa Application processes of several eminent countries.An appointment with our skilled consultants will act as an enabler for you to acquire an in-depth knowledge of the immigration process.Each situation demands a definitive and specific action and we reckon the fact that every individual has their own set of unique situations for which they would require specialized assistance. To take the right approach and increase the chances of your Visa clearance, it is imperative, you seek an expert advice. We facilitate your dialogue with our specialist Immigration Consultants and provide a transparent and clear understanding about your chances and the relevant opportunities lying ahead of you.Fly High Abroad urges you to register for the services at the earliest available opportunity so that we support you in addressing the unforeseen, time-consuming corrective actions, and ensure your concerns are resolved on time.Visa Application is a tedious and cumbersome process that, at times, renders people clueless to act. We, at Fly High Abroad, help you understand the different stages of the Visa Application, and with our renowned domain expertise; we help you avoid re-submissions or voiding of your application, which, would be an invaluable addition to your quest of settling Abroad."
    },{
        "id": "3",
        "title": "Visa Processing",
        "image": "https://private-user-images.githubusercontent.com/115803124/353451037-ae02783e-1407-4646-bfe9-387de2a2bb9d.jpg?jwt=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJnaXRodWIuY29tIiwiYXVkIjoicmF3LmdpdGh1YnVzZXJjb250ZW50LmNvbSIsImtleSI6ImtleTUiLCJleHAiOjE3MjIzNTQ5MDYsIm5iZiI6MTcyMjM1NDYwNiwicGF0aCI6Ii8xMTU4MDMxMjQvMzUzNDUxMDM3LWFlMDI3ODNlLTE0MDctNDY0Ni1iZmU5LTM4N2RlMmEyYmI5ZC5qcGc_WC1BbXotQWxnb3JpdGhtPUFXUzQtSE1BQy1TSEEyNTYmWC1BbXotQ3JlZGVudGlhbD1BS0lBVkNPRFlMU0E1M1BRSzRaQSUyRjIwMjQwNzMwJTJGdXMtZWFzdC0xJTJGczMlMkZhd3M0X3JlcXVlc3QmWC1BbXotRGF0ZT0yMDI0MDczMFQxNTUwMDZaJlgtQW16LUV4cGlyZXM9MzAwJlgtQW16LVNpZ25hdHVyZT02NTRlODkwM2E1Nzg3MGRhOWU1YTRiNzk4NjllODhiZmU0YWUzYzQyNDI3MzU0ZTBhNjJlNjgxYzdkOGRiMDVkJlgtQW16LVNpZ25lZEhlYWRlcnM9aG9zdCZhY3Rvcl9pZD0wJmtleV9pZD0wJnJlcG9faWQ9MCJ9.Ss7UN0F87kjTCydvC9cmSZUyf_KunPCd2X2jIZH0ZgM",
        "description": "Experience a seamless visa processing journey with our expert assistance. At FLY HIGH ABROAD, we provide a comprehensive service to streamline your visa application from start to finish. Initially, we assess your visa eligibility and determine the most suitable visa category based on your unique credentials, all at no charge. Once you engage our services, we take charge of every aspect of your application. This includes meticulous evaluation, preparation, and submission of your documents. Our dedicated team will maintain open lines of communication with the relevant visa authorities, prepare you for interviews if necessary, and handle all correspondence with the processing centers until your visa is granted. We address any concerns that arise, offering tailored solutions to ensure a smooth process. Our expertise extends to managing visa processing times, guiding you through the visa process, and assisting with requirements such as proof of work experience and English language proficiency. We also provide support in overcoming challenges like medical or criminal inadmissibility, application refusals, and long delays, ensuring that your visa application is managed with the highest level of professionalism and efficiency."
      },
      {
        "id": "4",
        "title": "Application Processing",
        "image": "https://private-user-images.githubusercontent.com/115803124/353451026-91a2b620-92aa-43ad-977f-222ee00f55c5.jpg?jwt=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJnaXRodWIuY29tIiwiYXVkIjoicmF3LmdpdGh1YnVzZXJjb250ZW50LmNvbSIsImtleSI6ImtleTUiLCJleHAiOjE3MjIzNTQ5MDYsIm5iZiI6MTcyMjM1NDYwNiwicGF0aCI6Ii8xMTU4MDMxMjQvMzUzNDUxMDI2LTkxYTJiNjIwLTkyYWEtNDNhZC05NzdmLTIyMmVlMDBmNTVjNS5qcGc_WC1BbXotQWxnb3JpdGhtPUFXUzQtSE1BQy1TSEEyNTYmWC1BbXotQ3JlZGVudGlhbD1BS0lBVkNPRFlMU0E1M1BRSzRaQSUyRjIwMjQwNzMwJTJGdXMtZWFzdC0xJTJGczMlMkZhd3M0X3JlcXVlc3QmWC1BbXotRGF0ZT0yMDI0MDczMFQxNTUwMDZaJlgtQW16LUV4cGlyZXM9MzAwJlgtQW16LVNpZ25hdHVyZT00MTBhNDZkNDhjZjAzMmYwOTQ0YTBmMDYzNjYzMGJjNjg0Njk4NGRjNzAwNzQxZjUzMjEyYzk2YzZmMTFmZTFkJlgtQW16LVNpZ25lZEhlYWRlcnM9aG9zdCZhY3Rvcl9pZD0wJmtleV9pZD0wJnJlcG9faWQ9MCJ9.-pFe6AHUeVMsVi4RfKibE-lGlCEeOK24tzBPiDUgmcw",
        "description": "Assess your immigration eligibility for free and determine your immigration category based on your credentials without any cost. At FLY HIGH ABROAD, we facilitate your entire application process with utmost care and expertise. Once you choose to retain our services, we will thoroughly evaluate, scrutinize, prepare, and submit your application, ensuring every detail is meticulously handled. Our team will communicate directly with the Immigration Visa Office, prepare you for any interviews where applicable, and manage all correspondence with the Processing Centre until your visa is issued. We address your concerns and provide effective solutions throughout the process. We offer comprehensive support in understanding immigration application processing times, navigating the immigration process, proving work experience, demonstrating English language ability, and resolving any immigration-related issues. We also provide assistance with medical inadmissibility, criminal inadmissibility, application refusals, and handling long delays, ensuring that you receive expert guidance every step of the way."
      }
  ]
  